stko/oobd/trunk/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/mc_can.c
/*----------------------------------------------------------------------------*/

uint32_t CAN_GetFilterReg32(uint8_t FilterID, uint8_t FilterReg)
{
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));

    /* Get the LowID of the 32bit Filter register Fx.FR1 */
    if (FilterReg == 1)		/* FR1 */
	return (uint32_t) CAN1->sFilterRegister[FilterID].FR1 >> 3;
    else if (FilterReg == 2)	/* FR2 */
	return (uint32_t) CAN1->sFilterRegister[FilterID].FR2 >> 3;
    else
	return NULL;
}

/*----------------------------------------------------------------------------*/

portBASE_TYPE bus_param_can_spec(param_data * args)
{
    CAN_FilterInitTypeDef CAN_FilterInitStructure;
    uint8_t i;

    switch (args->args[ARG_CMD]) {
    case PARAM_BUS_CONFIG:
	rxCount = 0;
	txCount = 0;
	errCount = 0;
	if (args->args[ARG_VALUE_1] != 0)
	    CAN1_Configuration(args->args[ARG_VALUE_1], CAN_Mode_Silent);	/* reinitialization of CAN interface */
	canConfig->busConfig = args->args[ARG_VALUE_1];
	createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0, NULL);
	break;

    case PARAM_BUS_MODE:
	rxCount = 0;
	txCount = 0;
	errCount = 0;
	switch (args->args[ARG_VALUE_1]) {
	case VALUE_BUS_MODE_SILENT:
	    CAN1_Configuration((uint8_t) canConfig->busConfig, CAN_Mode_Silent);	/* set CAN interface to silent mode */
	    canConfig->bus = args->args[ARG_VALUE_1];	/* set config.bus to current value of Paramter */
	    // send event information to the ILM task
	    CreateEventMsg(MSG_EVENT_BUS_MODE, MSG_EVENT_BUS_MODE_OFF);
	    createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0,
				   NULL);
	    break;
	case VALUE_BUS_MODE_LOOP_BACK:
	    CAN1_Configuration((uint8_t) canConfig->busConfig, CAN_Mode_LoopBack);	/* set CAN interface to loop back mode */
	    canConfig->bus = args->args[ARG_VALUE_1];	/* set config.bus to current value of Paramter */
	    // send event information to the ILM task
	    CreateEventMsg(MSG_EVENT_BUS_MODE, MSG_EVENT_BUS_MODE_ON);
	    createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0,
				   NULL);
	    break;
	case VALUE_BUS_MODE_LOOP_BACK_WITH_SILENT:
	    CAN1_Configuration((uint8_t) canConfig->busConfig, CAN_Mode_Silent_LoopBack);	/* set CAN interface to loop back combined with silent mode */
	    canConfig->bus = args->args[ARG_VALUE_1];	/* set config.bus to current value of Paramter */
	    // send event information to the ILM task
	    CreateEventMsg(MSG_EVENT_BUS_MODE, MSG_EVENT_BUS_MODE_ON);
	    createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0,
				   NULL);
	    break;
	case VALUE_BUS_MODE_NORMAL:
	    CAN1_Configuration((uint8_t) canConfig->busConfig, CAN_Mode_Normal);	/* set CAN interface to normal mode */
	    canConfig->bus = args->args[ARG_VALUE_1];	/* set config.bus to current value of Paramter */
	    // send event information to the ILM task
	    CreateEventMsg(MSG_EVENT_BUS_MODE, MSG_EVENT_BUS_MODE_ON);
	    createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0,
				   NULL);
	    break;

	default:
	    createCommandResultMsg(FBID_BUS_SPEC,
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED,
				   args->args[ARG_VALUE_1],
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED_TEXT);
	    break;
	}
	break;

    case PARAM_BUS_OUTPUT_ACTIVATE:
	rxCount = 0;
	txCount = 0;
	errCount = 0;
	switch (args->args[ARG_VALUE_1]) {
	case 0:
	case 1:
	    CreateEventMsg(MSG_EVENT_BUS_MODE, MSG_EVENT_BUS_MODE_OFF);
	    CreateEventMsg(MSG_EVENT_BUS_CHANNEL,
			   args->args[ARG_VALUE_1] == 1 ? 1 : 2);
	    sysIoCtrl(IO_REL1, 0, args->args[ARG_VALUE_1], 0, 0);
	    //! \bug this delay causes the protocol task to sleep for this time, but dring that his message queue runs full
	    //vTaskDelay( 250 / portTICK_RATE_MS ); // wait to give the mechanic relay time to switch
	    createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0,
				   NULL);
	    break;
	default:
	    createCommandResultMsg(FBID_BUS_SPEC,
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED,
				   args->args[ARG_VALUE_1],
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED_TEXT);
	    break;
	}
	break;

    case PARAM_BUS_Can11FilterID:	/* 11bit CAN filter ID reconfig */
	/* check CAN-ID */
	if (args->args[ARG_VALUE_2] < 0x7FF) {
	    /* check if Filter Number is odd */
	    if (args->args[ARG_VALUE_1] == 1)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 1;
	    else if (args->args[ARG_VALUE_1] == 3
		     || args->args[ARG_VALUE_1] == 2)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 2;
	    else if (args->args[ARG_VALUE_1] == 5
		     || args->args[ARG_VALUE_1] == 4)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 3;
	    else if (args->args[ARG_VALUE_1] == 7
		     || args->args[ARG_VALUE_1] == 6)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 4;
	    else if (args->args[ARG_VALUE_1] == 9
		     || args->args[ARG_VALUE_1] == 8)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 5;
	    else if (args->args[ARG_VALUE_1] == 10)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 6;
	    else {
		createCommandResultMsg(FBID_BUS_SPEC,
				       ERR_CODE_OS_COMMAND_NOT_SUPPORTED,
				       args->args[ARG_VALUE_1],
				       ERR_CODE_OS_COMMAND_NOT_SUPPORTED_TEXT);
		break;
	    }

	    if (args->args[ARG_VALUE_1] == 1 ||
		args->args[ARG_VALUE_1] == 3 ||
		args->args[ARG_VALUE_1] == 5 ||
		args->args[ARG_VALUE_1] == 7 ||
		args->args[ARG_VALUE_1] == 9) {
		CAN_FilterInitStructure.CAN_FilterIdLow =
		    args->args[ARG_VALUE_2] << 5;
		CAN_FilterInitStructure.CAN_FilterIdHigh =
		    (uint16_t) (CAN1->
				sFilterRegister[CAN_FilterInitStructure.
						CAN_FilterNumber].
				FR2 & 0x0000FFFF);
	    } else {
		CAN_FilterInitStructure.CAN_FilterIdLow =
		    (uint16_t) (CAN1->
				sFilterRegister[CAN_FilterInitStructure.
						CAN_FilterNumber].
				FR1 & 0x0000FFFF);
		CAN_FilterInitStructure.CAN_FilterIdHigh =
		    args->args[ARG_VALUE_2] << 5;
	    }

	    CAN_FilterInitStructure.CAN_FilterMaskIdLow =
		(uint16_t) (CAN1->
			    sFilterRegister[CAN_FilterInitStructure.
					    CAN_FilterNumber].
			    FR1 >> 16 & 0x0000FFFF);
	    CAN_FilterInitStructure.CAN_FilterMaskIdHigh =
		(uint16_t) (CAN1->
			    sFilterRegister[CAN_FilterInitStructure.
					    CAN_FilterNumber].
			    FR2 >> 16 & 0x0000FFFF);
	    CAN_FilterInitStructure.CAN_FilterScale =
		CAN_FilterScale_16bit;
	    CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	    CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	    CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	    CAN_FilterInit(&CAN_FilterInitStructure);
	    createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0,
				   NULL);
	} else {
	    createCommandResultMsg(FBID_BUS_SPEC,
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED,
				   args->args[ARG_VALUE_2],
				   ERR_CODE_OS_COMMAND_NOT_SUPPORTED_TEXT);
	}
	break;

    case PARAM_BUS_Can29FilterID:	/* 29bit CAN filter ID reconfig */
	CAN_FilterInitStructure.CAN_FilterNumber =
	    args->args[ARG_VALUE_1] - 1;
	CAN_FilterInitStructure.CAN_FilterIdLow =
	    (uint16_t) (args->args[ARG_VALUE_2] & 0x0000FFFF) << 3;
	CAN_FilterInitStructure.CAN_FilterIdHigh =
	    (uint16_t) (args->args[ARG_VALUE_2] >> 13) & 0x0000FFFF;
	CAN_FilterInitStructure.CAN_FilterMaskIdLow =
	    (uint16_t) (CAN1->
			sFilterRegister[CAN_FilterInitStructure.
					CAN_FilterNumber].
			FR2 & 0x0000FFFF);
	CAN_FilterInitStructure.CAN_FilterMaskIdHigh =
	    (uint16_t) (CAN1->
			sFilterRegister[CAN_FilterInitStructure.
					CAN_FilterNumber].
			FR2 >> 16 & 0x0000FFFF);
	CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	CAN_FilterInit(&CAN_FilterInitStructure);
	createCommandResultMsg(FBID_BUS_SPEC, ERR_CODE_NO_ERR, 0, NULL);
	break;

    case PARAM_BUS_Can11MaskID:	/* 11bit CAN filter mask ID reconfig */
	/* check CAN-ID */
	if (args->args[ARG_VALUE_2] <= 0x7FF) {
	    /* check filter mask number */
	    if (args->args[ARG_VALUE_1] == 1)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 1;
	    else if (args->args[ARG_VALUE_1] == 3
		     || args->args[ARG_VALUE_1] == 2)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 2;
	    else if (args->args[ARG_VALUE_1] == 5
		     || args->args[ARG_VALUE_1] == 4)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 3;
	    else if (args->args[ARG_VALUE_1] == 7
		     || args->args[ARG_VALUE_1] == 6)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 4;
	    else if (args->args[ARG_VALUE_1] == 9
		     || args->args[ARG_VALUE_1] == 8)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 5;
	    else if (args->args[ARG_VALUE_1] == 10)
		CAN_FilterInitStructure.CAN_FilterNumber =
		    args->args[ARG_VALUE_1] - 6;
	    else {
		createCommandResultMsg(FBID_BUS_SPEC,
				       ERR_CODE_OS_COMMAND_NOT_SUPPORTED,
				       args->args[ARG_VALUE_1],
				       ERR_CODE_OS_COMMAND_NOT_SUPPORTED_TEXT);
		break;
	    }

