stko/oobd/trunk/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/mc_can.c
/*----------------------------------------------------------------------------*/
void CAN1_SCE_IRQHandler(void)
{
    DEBUGUARTPRINT("\r\n*** CAN1_SCE_IRQHandler entered ***");
    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;

    /* check for receive errors */
    if (CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_StuffErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_FormErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_ACKErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_BitRecessiveErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_BitDominantErr
	|| CAN_GetLastErrorCode(CAN1) == CAN_ErrorCode_CRCErr)
	errCount++;		// increment err Counter if CAN error occurs

    /* clear all interrupt Flags */
    CAN_ClearITPendingBit(CAN1, CAN_IT_ERR);
    CAN_ClearITPendingBit(CAN1, CAN_IT_LEC);
    CAN_ClearITPendingBit(CAN1, CAN_IT_BOF);
    CAN_ClearITPendingBit(CAN1, CAN_IT_EPV);
    CAN_ClearITPendingBit(CAN1, CAN_IT_EWG);

    DEBUGUARTPRINT("\r\n*** CAN1_SCE_IRQHandler finished ***");
}

/*----------------------------------------------------------------------------*/
void USB_HP_CAN1_TX_IRQHandler(void)
{
    DEBUGUARTPRINT("\r\n*** USB_HP_CAN1_TX_IRQHandler entered ***");

    txCount++;			// increment CAN-Tx Counter if interrupt occurs
    if (txCount > 100000) {
	rxCount /= 2;
	txCount /= 2;
	errCount /= 2;
    }

    /* clear Tranmit interrupt flag */
    CAN_ClearITPendingBit(CAN1, CAN_IT_TME);

    DEBUGUARTPRINT("\r\n*** CAN1_SCE_IRQHandler finished ***");
}

/*----------------------------------------------------------------------------*/

portBASE_TYPE bus_rx_error_can()
{
    return errCount;
}

/*----------------------------------------------------------------------------*/

portBASE_TYPE bus_tx_error_can()
{
    return 0;
}

/*----------------------------------------------------------------------------*/

void bus_clear_rx_error_can()
{
    errCount = 0;
}

/*----------------------------------------------------------------------------*/

void bus_clear_tx_error_can()
{
}

/*----------------------------------------------------------------------------*/

portBASE_TYPE bus_rx_count_can()
{
    return rxCount;
}

/*----------------------------------------------------------------------------*/

portBASE_TYPE bus_tx_count_can()
{
    return txCount;
}

/*----------------------------------------------------------------------------*/

void bus_clear_rx_count_can()
{
    rxCount = 0;
}

/*----------------------------------------------------------------------------*/

void bus_clear_tx_count_can()
{
    txCount = 0;
}

portBASE_TYPE bus_busoff_error_can()
{
    /* check for Bus-off flag */
    stCANBusOffErr = CAN_GetFlagStatus(CAN1, CAN_FLAG_BOF);
    return stCANBusOffErr;
}

portBASE_TYPE bus_passive_error_can()
{
    /* check for Error passive flag */
    stCANBusPassiveErr = CAN_GetFlagStatus(CAN1, CAN_FLAG_EPV);
    return stCANBusPassiveErr;
}

portBASE_TYPE bus_warning_error_can()
{
    /* check for Error Warning flag */
    stCANBusWarningErr = CAN_GetFlagStatus(CAN1, CAN_FLAG_EWG);
    return stCANBusWarningErr;
}

portBASE_TYPE bus_tec_can()
{
    /* read Transmit Error Counter of CAN hardware */
    ctrCANTec = CAN_GetLSBTransmitErrorCounter(CAN1);
    return ctrCANTec;
}

portBASE_TYPE bus_rec_can()
{
    /* read Receive Error Counter of CAN hardware */
    ctrCANRec = CAN_GetReceiveErrorCounter(CAN1);
    return ctrCANRec;
}
